src/leets/1636-Sort-Array-by-Increasing-Frequency.org
#+title: 1636. Sort Array by Increasing Frequency
#+subtitle: leetcode
#+date: <2024-07-22>
#+language: en

** Problem:
Given an array of integers `nums`, you need to sort the array in increasing order based on the frequency of the values. If there are multiple values with the same frequency, you should sort them in decreasing order.

For example, input: `nums = [1,1,2,2,2,3]` should output: `[3,1,1,2,2,2]`.

** Solution Description:
To implement a solution for sorting the array by frequency, we need to:
1. Count the frequency of each element in the array.
2. Use a custom comparator to sort the array first by frequency in ascending order. If frequencies are the same, sort by value in descending order.

The steps to achieve this:
1. Create a frequency map that tracks how many times each element appears in the array.
2. Sort the array with a custom comparator that uses the frequency map; sort by frequency in ascending order and, in case of ties, by the element's value in descending order.

Time complexity is O(n log n) due to the sort operation. Space complexity is O(n) due to the additional space used by the frequency map.

** Example:
Let's consider the input `nums = [1,1,2,2,2,3]`.
1. Frequency map: {1: 2, 2: 3, 3: 1}
2. Sorted result: [3,1,1,2,2,2]

** Setup:
The initial code framework setup in modern JavaScript, including helper functions and dummy return values. We'll use simple `console.log` statements for testing and validation.

#+begin_src js :tangle "1636_sort_array_by_increasing_frequency.js"

/**
 ,* Function to sort the array by increasing frequency
 ,* @param {number[]} nums - An array of integers
 ,* @return {number[]} - Sorted array based on frequency and value
 ,*/
function sortByFrequency(nums) {
    // Helper log functions for testing and demonstrations
    const log = typeof NestedInteger !== 'undefined' ? () => {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () => {} : console.table;

    const f = {};
    nums.forEach(num => {
        f[num] = (f[num] || 0) + 1;
    });

    nums.sort((a, b) => {
        if (f[a] === f[b]) {
            return b - a;
        }
        return f[a] - f[b];
    });

    return nums;
}

// Test cases
const testCases = [
    { nums: [1,1,2,2,2,3], expected: [3,1,1,2,2,2]},
    { nums: [2,3,1,3,2], expected: [1,3,3,2,2] },
    { nums: [-1,1,-6,4,5,-6,1,4,1], expected: [5,-1,4,4,-6,-6,1,1,1] },
    { nums: [2,3,3,2,1], expected: [1,3,3,2,2] },
];

testCases.forEach((test, index) => {
    const result = sortByFrequency(test.nums);
    console.log(`Test Case ${index + 1}: ${result.join(',') === test.expected.join(',') ? 'Passed' : 'Failed'} (Expected: ${test.expected.join(',')}, Got: ${result.join(',')})`);
});

#+end_src

#+RESULTS:
: Test Case 1: Passed (Expected: 3,1,1,2,2,2, Got: 3,1,1,2,2,2)
: Test Case 2: Passed (Expected: 1,3,3,2,2, Got: 1,3,3,2,2)
: Test Case 3: Passed (Expected: 5,-1,4,4,-6,-6,1,1,1, Got: 5,-1,4,4,-6,-6,1,1,1)
: Test Case 4: Passed (Expected: 1,3,3,2,2, Got: 1,3,3,2,2)
: Test Case 5: Failed (Expected: 6,6,7,7,8,8,5,5,5, Got: 8,8,7,7,6,6,5,5,5)
: undefined
